В одномерном массиве произвести такую замену: 1 элемент поменять с 2 3 элемент поменять с 4 5 элемент поменять с 6 и тд Если массив непарный - последний элемент не трогать.

было 1 2 3 4 5 6, должно стать: 2 1 4 3 6 5
В двумерном массиве A размером n на m. Заполнить случайными числами.
Найти ряд, где сумма элементов наименьшая
Найти ряд, где сумма элементов найбольшая
Поменять ряды местами (1 и 2 пункт)

//Task 1
	var n = 25;
var Arr = new Array (n);
var mass = 0;
for (var i = 0; i < Arr.length; i++) {
    Arr[i] = Math.floor(Math.random()*10);
}
console.log(Arr);

for (var i = 0; i < Arr.length; i++) {
    if (i == 0 || i % 2 == 0) {
        mass = Arr[i];
    } else {
        Arr[i - 1] = Arr[i];
        Arr[i] = mass;
        buffer = 0;
    }
}
console.log(Arr);
